{
  "backend/main.mo": "Main backend actor implementing wake-up tracking with user profiles, wake-up time settings, photo submissions, and admin functions. Includes authorization checks for all operations and stores user data in maps keyed by Principal.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (wake-up settings, timer, photo capture, history, authentication) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files including components for wake-up settings, timer, photo capture, history, authentication, and custom hooks for game logic and backend queries.",
  "frontend/index.css": "Tailwind CSS configuration with OKLCH color system defining CSS variables for light and dark themes with Wake Up Warrior branding colors (dawn, morning, sky tones).",
  "frontend/index.html": "HTML entry point with root div and module script import for the React application, titled 'Snake Game'.",
  "frontend/src/App.tsx": "Root React component setting up QueryClient, ThemeProvider, AuthGuard, ProfileSetup, WakeUpLayout, and Toaster with proper provider nesting.",
  "frontend/src/components/AuthGuard.tsx": "Authentication wrapper component that shows loading state during initialization, login prompt for unauthenticated users, and renders children only when authenticated via Internet Identity.",
  "frontend/src/components/GameLayout.tsx": "Empty file (no content provided).",
  "frontend/src/components/GameOverScreen.tsx": "Empty file (no content provided).",
  "frontend/src/components/LoginButton.tsx": "Login/logout button component with loading states, error handling for duplicate authentication, and query cache clearing on logout.",
  "frontend/src/components/PhotoCapture.tsx": "Photo capture component with tabbed interface for camera capture or file upload, preview functionality, retake option, and submission handling with loading states and success feedback.",
  "frontend/src/components/PhotoRequirementModal.tsx": "Modal dialog that appears when user is late waking up and hasn't submitted a photo today, requiring them to upload a dressed photo to complete the challenge. Uses wake-up timer and photo submission hooks to determine when to show.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user profile setup modal that prompts for name input when no user profile exists. Prevents dismissal until profile is saved.",
  "frontend/src/components/ScoreDisplay.tsx": "Empty file with no content.",
  "frontend/src/components/SnakeGame.tsx": "Empty file with no content.",
  "frontend/src/components/WakeUpHistory.tsx": "Displays a scrollable list of past wake-up photo submissions with timestamps, showing whether each was on-time or late with minutes late calculated. Shows empty state when no submissions exist.",
  "frontend/src/components/WakeUpLayout.tsx": "Main application layout with header, hero section, settings/timer grid, history section, and footer. Includes PhotoRequirementModal and displays branding for Wake Up Warrior app.",
  "frontend/src/components/WakeUpSettings.tsx": "Settings card allowing users to configure target wake-up time (hour/minute selectors), enable/disable the challenge, and save settings. Shows current configuration and handles save mutations.",
  "frontend/src/components/WakeUpTimer.tsx": "Real-time status card displaying current time vs target wake-up time, showing either success (on-time) or warning (late with minutes) badges and messages. Displays disabled state when challenge is not enabled.",
  "frontend/src/hooks/useActor.ts": "React Query hook that creates and manages the backend actor instance based on Internet Identity authentication state, initializing access control with admin token and invalidating dependent queries when actor changes.",
  "frontend/src/hooks/useGameLoop.ts": "Empty file with no content.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides React context and hooks for Internet Identity authentication, managing login state, identity persistence, and AuthClient configuration with delegation validation.",
  "frontend/src/hooks/useKeyboardControls.ts": "Empty file, likely a placeholder for keyboard control hooks.",
  "frontend/src/hooks/usePhotoUpload.ts": "Custom hook that handles photo file uploads by converting files to data URLs and submitting them via the backend actor, tracking upload state and errors.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for fetching and mutating user profiles, wake-up time settings, and photo submissions through the backend actor.",
  "frontend/src/hooks/useUserProfile.ts": "Simple wrapper hook that re-exports the useGetCallerUserProfile query hook.",
  "frontend/src/hooks/useWakeUpTimer.ts": "Custom hook that calculates if the user is late based on wake-up time settings, updating current time every minute and computing minutes late.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a Wake Up Warrior theme including colors for dawn, morning, sky, and hero gradients in both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query and Internet Identity providers, then renders the root App component.",
  "frontend/src/types/game.ts": "Empty file, likely a placeholder for game-related TypeScript type definitions.",
  "frontend/src/utils/collisionDetection.ts": "Empty file, likely a placeholder for collision detection utility functions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color schemes for the Wake Up Warrior theme, container settings, border radius variables, and animation keyframes.",
  "project_state.json": "Project state file tracking an oversleeping accountability app with wake-up time tracking, photo verification, and history logging features. Contains 13 implemented features including wake-up time setting, lateness calculation, photo capture enforcement, and historical tracking."
}